# Rebar Get Crank Angled Length Method

Source: https://www.revitapidocs.com/2026/293eeda1-3edd-4dbd-9733-0d4cbef8b06c.htm

---

| Rebar Get Crank Angled Length Method |
| --- |

Gets the crank angled length at the indicated bar end.
 If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetCrankAngledLength(
	int end
)
```

```
Public Function GetCrankAngledLength (
	end As Integer
) As Double
```

```
public:
double GetCrankAngledLength(
	int end
)
```

```
member GetCrankAngledLength :
        end : int -> float
```

#### Parameters

end Int32
:   The bar end.

#### Return Value

Double
Returns the crank angled length. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | end must be 0 or 1\. |
| InvalidOperationException | The bar does not have a valid Rebar Crank Type at the end. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace